wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_timer.c
    /* read SYSCFG_TIMERCFG0 register value */
    TIMERxCFG0_value = SYSCFG_TIMERCFG0(TIMERx_temp) & 0x7FFF7FFFU;
    /* read SYSCFG_TIMERCFG1 register value */
    TIMERxCFG1_value = SYSCFG_TIMERCFG1(TIMERx_temp) & 0x7FFF03FFU;
    /* read SYSCFG_TIMERCFG2 register value */
    TIMERxCFG2_value = SYSCFG_TIMERCFG2(TIMERx_temp) & 0x001F7FFFU;

    if((0U == TIMERxCFG0_value) && (0U == TIMERxCFG1_value) && (0U == TIMERxCFG2_value)) {
        TIMERxCFG_temp = (BITS(16, 20) & ((uint32_t)(intrigger) << 16U));
        TIMERxCFG_addr = &SYSCFG_TIMERCFG2(TIMERx_temp);
    } else {
        if((SYSCFG_TIMERCFG0(TIMERx_temp) & 0x7FFF7FFFU) != 0U) {
            for(i = 0U; i < 3U; i++) {
                if((SYSCFG_TIMERCFG0(TIMERx_temp) & (BITS(0, 4) << (i * 5U))) != 0U) {
                    TIMERxCFG_temp = ((BITS(0, 4) << (i * 5U)) & ((uint32_t)(intrigger) << (i * 5U)));
                    break;
                }
            }
            for(i = 3U; i < 6U; i++) {
                if((SYSCFG_TIMERCFG0(TIMERx_temp) & (BITS(0, 4) << ((i * 5U) + 1U))) != 0U) {
                    TIMERxCFG_temp = ((BITS(0, 4) << ((i * 5U) + 1U)) & ((uint32_t)(intrigger) << ((i * 5U) + 1U)));
                    break;
                }
            }
            TIMERxCFG_addr = &SYSCFG_TIMERCFG0(TIMERx_temp);
        } else if((SYSCFG_TIMERCFG1(TIMERx_temp) & 0x7FFF03FFU) != 0U) {
            for(i = 6U; i < 8U; i++) {
                if((SYSCFG_TIMERCFG1(TIMERx_temp) & (BITS(0, 4) << ((i - 6U) * 5U))) != 0U) {
                    TIMERxCFG_temp = ((BITS(0, 4) << ((i - 6U) * 5U)) & ((uint32_t)(intrigger) << ((i - 6U) * 5U)));
                    break;
                }
            }
            for(i = 9U; i < 12U; i++) {
                if((SYSCFG_TIMERCFG1(TIMERx_temp) & (BITS(0, 4) << ((i - 6U) * 5U + 1U))) != 0U) {
                    TIMERxCFG_temp = ((BITS(0, 4) << ((i - 6U) * 5U + 1U)) & ((uint32_t)(intrigger) << ((i - 6U) * 5U + 1U)));
                    break;
                }
            }
            TIMERxCFG_addr = &SYSCFG_TIMERCFG1(TIMERx_temp);
        } else {
            for(i = 12U; i < 15U; i++) {
                if((SYSCFG_TIMERCFG2(TIMERx_temp) & (BITS(0, 4) << ((i - 12U) * 5U))) != 0U) {
                    TIMERxCFG_temp = ((BITS(0, 4) << ((i - 12U) * 5U)) & ((uint32_t)(intrigger) << ((i - 12U) * 5U)));
                    break;
                }
            }
            if((SYSCFG_TIMERCFG2(TIMERx_temp) & (BITS(0, 4) << 16U)) != 0U) {
                TIMERxCFG_temp = ((BITS(0, 4) << 16U) & ((uint32_t)(intrigger) << 16U));
            }
            TIMERxCFG_addr = &SYSCFG_TIMERCFG2(TIMERx_temp);
        }
    }

    if(TIMERxCFG_addr != NULL) {
        REG32(TIMERxCFG_addr) = TIMERxCFG_temp;
    } else {
    }
}

/*!
    \brief      select TIMER master mode output 0 trigger source (API_ID(0x003CU))
    \param[in]  timer_periph: TIMERx(x=0~7,14,22,23,30,31,40~44,50,51)
    \param[in]  outrigger: trigger output 0 source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_TRI_OUT0_SRC_RESET: the UPG bit as trigger output 0(TIMERx(x=0~7,14,22,23,30,31,50,51))
      \arg        TIMER_TRI_OUT0_SRC_ENABLE: the counter enable signal as trigger output 0(TIMERx(x=0~7,14,22,23,30,31,50,51))
      \arg        TIMER_TRI_OUT0_SRC_UPDATE: update event as trigger output 0(TIMERx(x=0~7,14,22,23,30,31,50,51))
      \arg        TIMER_TRI_OUT0_SRC_CH0: a capture or a compare match occurred in channel 0 as trigger output 0(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_TRI_OUT0_SRC_O0CPRE: O0CPRE as trigger output 0(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_TRI_OUT0_SRC_O1CPRE: O1CPRE as trigger output 0(TIMERx(x=0~4,7,14,22,23,30,31,40~44))
      \arg        TIMER_TRI_OUT0_SRC_O2CPRE: O2CPRE as trigger output 0(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_TRI_OUT0_SRC_O3CPRE: O3CPRE as trigger output 0(TIMERx(x=0~4,7,22,23,30,31))
      \arg        TIMER_TRI_OUT0_SRC_DECODER_CLOCK: decoder clock as trigger output 0(TIMERx(x=0~4,7,22,23,30,31))
    \param[out] none
    \retval     none
*/
void timer_master_output0_trigger_source_select(uint32_t timer_periph, uint32_t outrigger)
{
    uint32_t reg;

    reg  = TIMER_CTL1(timer_periph);
    reg &= (~(uint32_t)TIMER_CTL1_MMC0);
    reg |= (uint32_t)(outrigger & TIMER_CTL1_MMC0);
    TIMER_CTL1(timer_periph) = reg;
}

/*!
    \brief      select TIMER master mode output 1 trigger source (API_ID(0x003DU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  outrigger: trigger output 1 source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_TRI_OUT1_SRC_RESET: the UPG bit as trigger output 1
      \arg        TIMER_TRI_OUT1_SRC_ENABLE: the counter enable signal TIMER_CTL0_CEN as trigger output 1
      \arg        TIMER_TRI_OUT1_SRC_UPDATE: update event as trigger output 1
      \arg        TIMER_TRI_OUT1_SRC_CH0: a capture or a compare match occurred in channel 0 as trigger output 1
      \arg        TIMER_TRI_OUT1_SRC_O0CPRE: O0CPRE as trigger output 1
      \arg        TIMER_TRI_OUT1_SRC_O1CPRE: O1CPRE as trigger output 1
      \arg        TIMER_TRI_OUT1_SRC_O2CPRE: O2CPRE as trigger output 1
      \arg        TIMER_TRI_OUT1_SRC_O3CPRE: O3CPRE as trigger output 1
    \param[out] none
    \retval     none
*/
void timer_master_output1_trigger_source_select(uint32_t timer_periph, uint32_t outrigger)
{
    uint32_t reg;

    reg  = TIMER_CTL1(timer_periph);
    reg &= (~(uint32_t)TIMER_CTL1_MMC1);
    reg |= (uint32_t)(outrigger & TIMER_CTL1_MMC1);
    TIMER_CTL1(timer_periph) = reg;
}

/*!
    \brief      select TIMER slave mode (API_ID(0x003EU))
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,22,23,30,31,40~44)
    \param[in]  slavemode: slave mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SLAVE_MODE_DISABLE: slave mode disable(x=0~4,7,14,22,23,30,31,40~44)
      \arg        TIMER_QUAD_DECODER_MODE0: quadrature decoder mode 0(x=0~4,7,22,23,30,31)
      \arg        TIMER_QUAD_DECODER_MODE1: quadrature decoder mode 1(x=0~4,7,22,23,30,31)
      \arg        TIMER_QUAD_DECODER_MODE2: quadrature decoder mode 2(x=0~4,7,22,23,30,31)
      \arg        TIMER_SLAVE_MODE_RESTART: restart mode(x=0~4,7,14,22,23,30,31,40~44)
      \arg        TIMER_SLAVE_MODE_PAUSE: pause mode(x=0~4,7,14,22,23,30,31,40~44)
      \arg        TIMER_SLAVE_MODE_EVENT: event mode(x=0~4,7,14,22,23,30,31,40~44)
      \arg        TIMER_SLAVE_MODE_EXTERNAL0: external clock mode 0(x=0~4,7,14,22,23,30,31,40~44)
      \arg        TIMER_SLAVE_MODE_RESTART_EVENT: restart + event mode(x=0~4,7,14,22,23,30,31,40~44)
      \arg        TIMER_DECODER_MODE0: decoder mode 0(x=0~4,7,22,23,30,31)
      \arg        TIMER_DECODER_MODE1: decoder mode 1(x=0~4,7,22,23,30,31)
      \arg        TIMER_DECODER_MODE2: decoder mode 0(x=0~4,7,22,23,30,31)
      \arg        TIMER_DECODER_MODE3: decoder mode 1(x=0~4,7,22,23,30,31)
      \arg        TIMER_QUAD_DECODER_MODE3: quadrature decoder mode 3(x=0~4,7,22,23,30,31)
      \arg        TIMER_QUAD_DECODER_MODE4: quadrature decoder 4(x=0~4,7,22,23,30,31)
    \param[out] none
    \retval     none
*/
void timer_slave_mode_select(uint32_t timer_periph, uint32_t slavemode)
{
    uint8_t TIMERx_temp = 0U;
    uint32_t TIMERxCFG_temp = 0U;
    volatile uint32_t *TIMERxCFG_addr = NULL;
    uint32_t trigger_temp = 0U;
    uint8_t i = 0U;
    uint32_t TIMERxCFG0_value, TIMERxCFG1_value, TIMERxCFG2_value;

