wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_timer.c
    switch(timer_periph) {
    case TIMER0:
        TIMERx_temp = SYSCFG_TIMER0;
        break;
    case TIMER1:
        TIMERx_temp = SYSCFG_TIMER1;
        break;
    case TIMER2:
        TIMERx_temp = SYSCFG_TIMER2;
        break;
    case TIMER3:
        TIMERx_temp = SYSCFG_TIMER3;
        break;
    case TIMER4:
        TIMERx_temp = SYSCFG_TIMER4;
        break;
    case TIMER7:
        TIMERx_temp = SYSCFG_TIMER7;
        break;
    case TIMER14:
        TIMERx_temp = SYSCFG_TIMER14;
        break;
    case TIMER22:
        TIMERx_temp = SYSCFG_TIMER22;
        break;
    case TIMER23:
        TIMERx_temp = SYSCFG_TIMER23;
        break;
    case TIMER30:
        TIMERx_temp = SYSCFG_TIMER30;
        break;
    case TIMER31:
        TIMERx_temp = SYSCFG_TIMER31;
        break;
    case TIMER40:
        TIMERx_temp = SYSCFG_TIMER40;
        break;
    case TIMER41:
        TIMERx_temp = SYSCFG_TIMER41;
        break;
    case TIMER42:
        TIMERx_temp = SYSCFG_TIMER42;
        break;
    case TIMER43:
        TIMERx_temp = SYSCFG_TIMER43;
        break;
    case TIMER44:
        TIMERx_temp = SYSCFG_TIMER44;
        break;
    default:
        break;
    }

    /* read SYSCFG_TIMERCFG0 register value */
    TIMERxCFG0_value = SYSCFG_TIMERCFG0(TIMERx_temp) & 0x7FFF7FFFU;
    /* read SYSCFG_TIMERCFG1 register value */
    TIMERxCFG1_value = SYSCFG_TIMERCFG1(TIMERx_temp) & 0x7FFF03FFU;
    /* read SYSCFG_TIMERCFG2 register value */
    TIMERxCFG2_value = SYSCFG_TIMERCFG2(TIMERx_temp) & 0x001F7FFFU;

    if((0U == TIMERxCFG0_value) && (0U == TIMERxCFG1_value) && (0U == TIMERxCFG2_value)) {
        if(slavemode <= 2U) {
            TIMERxCFG_temp = (uint32_t)0x1F << (slavemode * 5U);
        } else if((slavemode <= 5U) && (slavemode >= 3U)) {
            TIMERxCFG_temp = (uint32_t)0x1F << ((slavemode * 5U) + 1U);
        } else if((slavemode <= 7U) && (slavemode >= 6U)) {
            TIMERxCFG_temp = (uint32_t)0x1F << ((slavemode - 6U) * 5U);
        } else if((slavemode <= 11U) && (slavemode >= 9U)) {
            TIMERxCFG_temp = (uint32_t)0x1F << (((slavemode - 6U) * 5U) + 1U);
        } else if((slavemode <= 14U) && (slavemode >= 12U)) {
            TIMERxCFG_temp = (uint32_t)0x1F << (((slavemode - 12U) * 5U));
        } else if(slavemode == 15U) {
            TIMERxCFG_temp = (uint32_t)0x1F << (((slavemode - 12U) * 5U) + 1U);
        } else {

        }
    } else {
        if((SYSCFG_TIMERCFG0(TIMERx_temp) & 0x7FFF7FFFU) != 0U) {
            for(i = 0U; i < 3U; i++) {
                if((SYSCFG_TIMERCFG0(TIMERx_temp) & (BITS(0, 4) << (i * 5U))) != 0U) {
                    trigger_temp = (SYSCFG_TIMERCFG0(TIMERx_temp) & (BITS(0, 4) << (i * 5U))) >> (i * 5U);
                    SYSCFG_TIMERCFG0(TIMERx_temp) = 0U;
                    break;
                }
            }
            for(i = 3U; i < 6U; i++) {
                if((SYSCFG_TIMERCFG0(TIMERx_temp) & (BITS(0, 4) << ((i * 5U) + 1U))) != 0U) {
                    trigger_temp = (SYSCFG_TIMERCFG0(TIMERx_temp) & (BITS(0, 4) << ((i * 5U) + 1U))) >> ((i * 5U) + 1U);
                    SYSCFG_TIMERCFG0(TIMERx_temp) = 0U;
                    break;
                }
            }
        } else if((SYSCFG_TIMERCFG1(TIMERx_temp) & 0x7FFF03FFU) != 0U) {
            for(i = 6U; i < 8U; i++) {
                if((SYSCFG_TIMERCFG1(TIMERx_temp) & (BITS(0, 4) << ((i - 6U) * 5U))) != 0U) {
                    trigger_temp = (SYSCFG_TIMERCFG1(TIMERx_temp) & (BITS(0, 4) << ((i - 6U) * 5U))) >> ((i - 6U) * 5U);
                    SYSCFG_TIMERCFG1(TIMERx_temp) = 0U;
                    break;
                }
            }
            for(i = 9U; i < 12U; i++) {
                if((SYSCFG_TIMERCFG1(TIMERx_temp) & (BITS(0, 4) << ((i - 6U) * 5U + 1U))) != 0U) {
                    trigger_temp = (SYSCFG_TIMERCFG1(TIMERx_temp) & (BITS(0, 4) << ((i - 6U) * 5U + 1U))) >> ((i - 6U) * 5U + 1U);
                    SYSCFG_TIMERCFG1(TIMERx_temp) = 0U;
                    break;
                }
            }
        } else {
            for(i = 12U; i < 15U; i++) {
                if((SYSCFG_TIMERCFG2(TIMERx_temp) & (BITS(0, 4) << ((i - 12U) * 5U))) != 0U) {
                    trigger_temp = (SYSCFG_TIMERCFG2(TIMERx_temp) & (BITS(0, 4) << ((i - 12U) * 5U))) >> ((i - 12U) * 5U);
                    SYSCFG_TIMERCFG2(TIMERx_temp) = 0U;
                    break;
                }
            }
            if((SYSCFG_TIMERCFG2(TIMERx_temp) & (BITS(0, 4) << 16U)) != 0U) {
                trigger_temp = (SYSCFG_TIMERCFG2(TIMERx_temp) & (BITS(0, 4) << 16U)) >> 16U;
                SYSCFG_TIMERCFG2(TIMERx_temp) = 0U;
            }
        }

        if(slavemode <= 2U) {
            TIMERxCFG_temp = trigger_temp << (slavemode * 5U);
        } else if((slavemode <= 5U) && (slavemode >= 3U)) {
            TIMERxCFG_temp = trigger_temp << ((slavemode * 5U) + 1U);
        } else if((slavemode <= 7U) && (slavemode >= 6U)) {
            TIMERxCFG_temp = trigger_temp << ((slavemode - 6U) * 5U);
        } else if((slavemode <= 11U) && (slavemode >= 9U)) {
            TIMERxCFG_temp = trigger_temp << (((slavemode - 6U) * 5U) + 1U);
        } else if((slavemode <= 14U) && (slavemode >= 12U)) {
            TIMERxCFG_temp = trigger_temp << (((slavemode - 12U) * 5U));
        } else if(slavemode == 15U) {
            TIMERxCFG_temp = trigger_temp << (((slavemode - 12U) * 5U) + 1U);
        } else {

        }
    }

    if(slavemode <= 5U) {
        TIMERxCFG_addr = &SYSCFG_TIMERCFG0(TIMERx_temp);
        REG32(TIMERxCFG_addr) = TIMERxCFG_temp;
    } else if(((slavemode >= 6U) && (slavemode <= 7U)) || ((slavemode >= 9U) && (slavemode <= 11U))) {
        TIMERxCFG_addr = &SYSCFG_TIMERCFG1(TIMERx_temp);
        REG32(TIMERxCFG_addr) = TIMERxCFG_temp;
    } else if((slavemode >= 12U) && (slavemode <= 15U)) {
        TIMERxCFG_addr = &SYSCFG_TIMERCFG2(TIMERx_temp);
        REG32(TIMERxCFG_addr) = TIMERxCFG_temp;
    } else {

