wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_timer.c
/*!
    \brief      configure TIMER break polarity (API_ID(0x0055U))
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: BREAK0 input signal, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_BREAK1: BREAK1 input signal, TIMERx(x=0,7)
    \param[in]  break_src: break source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BRKIN0: BRKIN0 alternate function input enable, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_BRKIN1: BRKIN1 alternate function input enable, TIMERx(x=0,7)
      \arg        TIMER_BRKIN2: BRKIN2 alternate function input enable, TIMERx(x=0,7)
      \arg        TIMER_BRKCMP0: CMP0 input enable, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_BRKCMP1: CMP1 input enable, TIMERx(x=0,7,14~16,40~44)
    \param[in]  bkinpolarity: break polarity
                only one parameter can be selected which is shown as below:
                  TIMER_BRKIN_POLARITY_LOW: input signal will not be inverted
                  TIMER_BRKIN_POLARITY_HIGH: input signal will be inverted
    \param[out] none
    \retval     none
*/
void timer_break_external_polarity_config(uint32_t timer_periph, uint16_t break_num, uint32_t break_src, uint16_t bkinpolarity)
{
    if(TIMER_BREAK0 == break_num) {
        switch(break_src) {
        case TIMER_BRKIN0:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKIN0P);
            TIMER_AFCTL0(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 16U) & TIMER_BRKIN0P);
            break;
        case TIMER_BRKIN1:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKIN1P);
            TIMER_AFCTL0(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 17U) & TIMER_BRKIN1P);
            break;
        case TIMER_BRKIN2:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKIN2P);
            TIMER_AFCTL0(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 18U) & TIMER_BRKIN2P);
            break;
        case TIMER_BRKCMP0:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKCMP0P);
            TIMER_AFCTL0(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 25U) & TIMER_BRKCMP0P);
            break;
        case TIMER_BRKCMP1:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKCMP1P);
            TIMER_AFCTL0(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 26U) & TIMER_BRKCMP1P);
            break;
        default:
            break;
        }
    } else {
        switch(break_src) {
        case TIMER_BRKIN0:
            TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_BRKIN0P);
            TIMER_AFCTL1(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 16U) & TIMER_BRKIN0P);
            break;
        case TIMER_BRKIN1:
            TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_BRKIN1P);
            TIMER_AFCTL1(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 17U) & TIMER_BRKIN1P);
            break;
        case TIMER_BRKIN2:
            TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_BRKIN2P);
            TIMER_AFCTL1(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 18U) & TIMER_BRKIN2P);
            break;
        case TIMER_BRKCMP0:
            TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_BRKCMP0P);
            TIMER_AFCTL1(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 25U) & TIMER_BRKCMP0P);
            break;
        case TIMER_BRKCMP1:
            TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_BRKCMP1P);
            TIMER_AFCTL1(timer_periph) |= (uint32_t)(((uint32_t)bkinpolarity << 26U) & TIMER_BRKCMP1P);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure TIMER break lock function (API_ID(0x0056U))
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: enable BREAK0 lock function, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_BREAK1: enable BREAK1 lock function, TIMERx(x=0,7)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_break_lock_config(uint32_t timer_periph, uint16_t break_num, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        if(TIMER_BREAK0 == break_num) {
            TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_BRK0LK;
        } else {
            TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_BRK1LK;
        }
    } else {
        if(TIMER_BREAK0 == break_num) {
            TIMER_CCHP(timer_periph) &= (~(uint32_t)TIMER_CCHP_BRK0LK);
        } else {
            TIMER_CCHP(timer_periph) &= (~(uint32_t)TIMER_CCHP_BRK1LK);
        }
    }
}

/*!
    \brief      release the TIMER break lock function (API_ID(0x0057U))
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,40~44)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: release the BREAK0 lock function, TIMERx(x=0,7,14~16,40~44)
      \arg        TIMER_BREAK1: release the BREAK1 lock function, TIMERx(x=0,7)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_break_lock_release_config(uint32_t timer_periph, uint16_t break_num, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        if(TIMER_BREAK0 == break_num) {
            TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_BRK0REL;
        } else {
            TIMER_CCHP(timer_periph) |= (uint32_t)TIMER_CCHP_BRK1REL;
        }
    } else {
        if(TIMER_BREAK0 == break_num) {
            TIMER_CCHP(timer_periph) &= (~(uint32_t)TIMER_CCHP_BRK0REL);
        } else {
            TIMER_CCHP(timer_periph) &= (~(uint32_t)TIMER_CCHP_BRK1REL);
        }
    }
}

/*!
    \brief      configure the TIMER channel break control function (API_ID(0x0058U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0
      \arg        TIMER_CH_1: TIMER channel 1
      \arg        TIMER_CH_2: TIMER channel 2
      \arg        TIMER_CH_3: TIMER channel 3
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_break_control_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL2(timer_periph) |= (uint32_t)(TIMER_CTL2_BRKENCH0 << (channel & TIMER_CHANNEL_MASK));
    } else {
        TIMER_CTL2(timer_periph) &= (~(uint32_t)(TIMER_CTL2_BRKENCH0 << (channel & TIMER_CHANNEL_MASK)));
    }
}

/*!
    \brief      configure the TIMER channel free dead time function (API_ID(0x0059U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0
      \arg        TIMER_CH_1: TIMER channel 1
      \arg        TIMER_CH_2: TIMER channel 2
      \arg        TIMER_CH_3: TIMER channel 3
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_dead_time_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL2(timer_periph) |= (uint32_t)(TIMER_CTL2_DTIENCH0 << (channel & TIMER_CHANNEL_MASK));
    } else {
        TIMER_CTL2(timer_periph) &= (~(uint32_t)(TIMER_CTL2_DTIENCH0 << (channel & TIMER_CHANNEL_MASK)));
    }
}

/*!
    \brief      initialize TIMER channel free complementary parameter struct with a default value (API_ID(0x005AU))
    \param[in]  freecompara: TIMER channel free complementary parameter struct
    \param[out] none
    \retval     none
*/
void timer_free_complementary_struct_para_init(timer_free_complementary_parameter_struct *freecompara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(freecompara)) {
        fw_debug_report_err(TIMER_MODULE_ID, (API_ID(0x005AU)), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the channel free complementary parameter struct member with the default value */
        freecompara->freecomstate = TIMER_FCCHP_STATE_DISABLE;
        freecompara->runoffstate  = TIMER_ROS_STATE_DISABLE;
        freecompara->ideloffstate = TIMER_IOS_STATE_DISABLE;
        freecompara->deadtime     = 0U;
    }
}

/*!
    \brief      configure channel free complementary protection (API_ID(0x005BU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0
      \arg        TIMER_CH_1: TIMER channel 1
      \arg        TIMER_CH_2: TIMER channel 2
      \arg        TIMER_CH_3: TIMER channel 3
    \param[in] fcpara: TIMER channel free complementary parameter struct
                freecomstate: TIMER_FCCHP_STATE_ENABLE, TIMER_FCCHP_STATE_DISABLE
                runoffstate: TIMER_ROS_STATE_ENABLE, TIMER_ROS_STATE_DISABLE
                ideloffstate: TIMER_IOS_STATE_ENABLE, TIMER_IOS_STATE_DISABLE
                deadtime: 0~255
    \param[out] none
    \retval     none
*/
void timer_channel_free_complementary_config(uint32_t timer_periph, uint16_t channel, timer_free_complementary_parameter_struct *fcpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(fcpara)) {
        fw_debug_report_err(TIMER_MODULE_ID, (API_ID(0x005AU)), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        case TIMER_CH_0:
            TIMER_FCCHP0(timer_periph) &= (~(uint32_t)(TIMER_FCCHP0_DTCFG | TIMER_FCCHP0_IOS | TIMER_FCCHP0_ROS | TIMER_FCCHP0_FCCHP0EN));
            TIMER_FCCHP0(timer_periph) |= (fcpara->deadtime & TIMER_FCCHP0_DTCFG);
            TIMER_FCCHP0(timer_periph) |= (fcpara->ideloffstate & TIMER_FCCHP0_IOS);
            TIMER_FCCHP0(timer_periph) |= (fcpara->runoffstate & TIMER_FCCHP0_ROS);
            TIMER_FCCHP0(timer_periph) |= (fcpara->freecomstate & TIMER_FCCHP0_FCCHP0EN);
            break;
        case TIMER_CH_1:
            TIMER_FCCHP1(timer_periph) &= (~(uint32_t)(TIMER_FCCHP1_DTCFG | TIMER_FCCHP1_IOS | TIMER_FCCHP1_ROS | TIMER_FCCHP1_FCCHP1EN));
            TIMER_FCCHP1(timer_periph) |= (fcpara->deadtime & TIMER_FCCHP1_DTCFG);
            TIMER_FCCHP1(timer_periph) |= (fcpara->ideloffstate & TIMER_FCCHP1_IOS);
            TIMER_FCCHP1(timer_periph) |= (fcpara->runoffstate & TIMER_FCCHP1_ROS);
            TIMER_FCCHP1(timer_periph) |= (fcpara->freecomstate & TIMER_FCCHP1_FCCHP1EN);
            break;
        case TIMER_CH_2:
            TIMER_FCCHP2(timer_periph) &= (~(uint32_t)(TIMER_FCCHP2_DTCFG | TIMER_FCCHP2_IOS | TIMER_FCCHP2_ROS | TIMER_FCCHP2_FCCHP2EN));
            TIMER_FCCHP2(timer_periph) |= (fcpara->deadtime & TIMER_FCCHP2_DTCFG);
            TIMER_FCCHP2(timer_periph) |= (fcpara->ideloffstate & TIMER_FCCHP2_IOS);
            TIMER_FCCHP2(timer_periph) |= (fcpara->runoffstate & TIMER_FCCHP2_ROS);
            TIMER_FCCHP2(timer_periph) |= (fcpara->freecomstate & TIMER_FCCHP2_FCCHP2EN);
            break;
        case TIMER_CH_3:
            TIMER_FCCHP3(timer_periph) &= (~(uint32_t)(TIMER_FCCHP3_DTCFG | TIMER_FCCHP3_IOS | TIMER_FCCHP3_ROS | TIMER_FCCHP3_FCCHP3EN));
            TIMER_FCCHP3(timer_periph) |= (fcpara->deadtime & TIMER_FCCHP3_DTCFG);
            TIMER_FCCHP3(timer_periph) |= (fcpara->ideloffstate & TIMER_FCCHP3_IOS);
            TIMER_FCCHP3(timer_periph) |= (fcpara->runoffstate & TIMER_FCCHP3_ROS);
            TIMER_FCCHP3(timer_periph) |= (fcpara->freecomstate & TIMER_FCCHP3_FCCHP3EN);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure the TIMER channel break (API_ID(0x005CU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  breaken: TIMER channel break enable
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_BREAK_ENABLE: channel BREAK input signal enable
      \arg        TIMER_CH_BREAK_DISABLE: channel BREAK input signal disable
    \param[in] breakpolarity: channel BREAK input signal polarity
      \arg        TIMER_CH_BREAK_POLARITY_HIGH: channel BREAK input active high
      \arg        TIMER_CH_BREAK_POLARITY_LOW: channel BREAK input active low
    \param[in] break0filter: 0~15
    \param[out] none
    \retval     none
*/
void timer_channel_break_config(uint32_t timer_periph, uint32_t breaken, uint32_t breakpolarity, uint32_t break0filter)
{
    TIMER_CCHP(timer_periph) &= (~(uint32_t)(TIMER_CCHP_CHBRKEN | TIMER_CCHP_CHBRKP | TIMER_CCHP_BRK0F));
    TIMER_CCHP(timer_periph) |= (uint32_t)((breaken & TIMER_CCHP_CHBRKEN) | (breakpolarity & TIMER_CCHP_CHBRKP) | ((
            break0filter << 16U) & TIMER_CCHP_BRK0F));
}

/*!
    \brief      configure TIMER channel break external input enable (API_ID(0x005DU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7))
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_break_external_status_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
    switch(channel) {
    case TIMER_CH_0:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH0BRKINEN;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH0BRKINEN);
        }
        break;
    case TIMER_CH_1:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH1BRKINEN;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH1BRKINEN);
        }
        break;
    case TIMER_CH_2:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH2BRKINEN;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH2BRKINEN);
        }
        break;
    case TIMER_CH_3:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH3BRKINEN;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH3BRKINEN);
        }
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel break external input polarity (API_ID(0x005EU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7))
    \param[in]  bkinpolarity: channel x BREAK input signal polarity
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CHx_BREAK_IN_INV: channel x BREAK input signal will be inverted
      \arg        TIMER_CHx_BREAK_IN_NOT_INV: channel x BREAK input signal will not be inverted
    \param[out] none
    \retval     none
*/
void timer_channel_break_external_polarity_config(uint32_t timer_periph, uint32_t channel, uint16_t bkinpolarity)
{
    switch(channel) {
    case TIMER_CH_0:
        if(TIMER_CHx_BREAK_IN_INV == bkinpolarity) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH0BRKINP;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH0BRKINP);
        }
        break;
    case TIMER_CH_1:
        if(TIMER_CHx_BREAK_IN_INV == bkinpolarity) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH1BRKINP;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH1BRKINP);
        }
        break;
    case TIMER_CH_2:
        if(TIMER_CHx_BREAK_IN_INV == bkinpolarity) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH2BRKINP;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH2BRKINP);
        }
        break;
    case TIMER_CH_3:
        if(TIMER_CHx_BREAK_IN_INV == bkinpolarity) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CH3BRKINP;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CH3BRKINP);
        }
        break;
    default:
        break;
    }
}



/*!
    \brief      configure TIMER channel primary output function (API_ID(0x005FU))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0,7))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0,7))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0,7))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0,7))
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_primary_output_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
    switch(channel) {
    case TIMER_CH_0:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CHPOEN0;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CHPOEN0);
        }
        break;
    case TIMER_CH_1:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CHPOEN1;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CHPOEN1);
        }
        break;
    case TIMER_CH_2:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CHPOEN2;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CHPOEN2);
        }
        break;
    case TIMER_CH_3:
        if(ENABLE == newvalue) {
            TIMER_CHBRKCTL(timer_periph) |= (uint32_t)TIMER_CHBRKCTL_CHPOEN3;
        } else {
            TIMER_CHBRKCTL(timer_periph) &= (~(uint32_t)TIMER_CHBRKCTL_CHPOEN3);
        }
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel break period value (API_ID(0x0060U))
    \param[in]  timer_periph: TIMERx(x=0,7)
    \param[in]  value: channel break period value, 0~0xFFFF
    \param[out] none
    \retval     none
*/
void timer_channel_break_period_config(uint32_t timer_periph, uint16_t value)
{
    TIMER_CHBRKPER(timer_periph) = (uint32_t)value;
}

/*!
    \brief      configure quadrature decoder signal disconnection detection watchdog value (API_ID(0x0061U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23,30,31)
    \param[in]  value: watchdog counter period value, 0~0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void timer_watchdog_value_config(uint32_t timer_periph, uint32_t value)
{
    TIMER_WDGPER(timer_periph) = value;
}

/*!
    \brief      read quadrature decoder signal disconnection detection watchdog value (API_ID(0x0062U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23,30,31)
    \param[out] none
    \retval     watchdog counter period register value, 0~0xFFFFFFFF
*/
uint32_t timer_watchdog_value_read(uint32_t timer_periph)
{
    return (TIMER_WDGPER(timer_periph));
}

/*!
    \brief      configure quadrature decoder signal disconnection detection function (API_ID(0x0063U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23,30,31)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_decoder_disconnection_detection_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL2(timer_periph) |= TIMER_DECDISCONNECTDEN;
    } else {
        TIMER_CTL2(timer_periph) &= (~TIMER_DECDISCONNECTDEN);
    }
}

/*!
    \brief      configure quadrature decoder signal jump detection function (API_ID(0x0064U))
    \param[in]  timer_periph: TIMERx(x=0~4,7,22,23,30,31)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_decoder_jump_detection_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL2(timer_periph) |= TIMER_DECJUMPDEN;
    } else {
        TIMER_CTL2(timer_periph) &= (~TIMER_DECJUMPDEN);
    }
}

/*!
    \brief      configure the UPIF bit backup function (API_ID(0x0065U))
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,30,31,40~44,50,51)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_upif_backup_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_UPIFBUEN;
    } else {
        TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_UPIFBUEN);
    }
}

/*!
    \brief      get the UPIFBU bit in the TIMERx_CNT register (API_ID(0x0066U))
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,22,23,30,31,40~44,50,51)
    \param[out] none
    \retval     UPIFBUStatus: VALID_SET or VALID_RESET or INVALID
      \ret        VALID_SET: the UPIFBU is valid and value is 1
      \ret        VALID_RESET: the UPIFBU is valid and value is 0
      \ret        INVALID: the UPIFBU is invalid
*/
UPIFBUStatus timer_upifbu_bit_get(uint32_t timer_periph)
{
    UPIFBUStatus ret = VALID_RESET;
    if((TIMER_CTL0(timer_periph) & TIMER_CTL0_UPIFBUEN)) {
        if((TIMER50 == timer_periph) || (TIMER51 == timer_periph)) {
            if(TIMER_CNTH(timer_periph) & TIMER_CNT_UPIFBU) {
                ret = VALID_SET;
            } else {
                ret = VALID_RESET;
            }
        } else {
            if(TIMER_CNT(timer_periph) & TIMER_CNT_UPIFBU) {
                ret = VALID_SET;
            } else {
                ret = VALID_RESET;
            }
        }
    } else {
        ret = INVALID;
    }
    return ret;
}

